---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ViewSheetSetUIService
source: html/d47040f8-082d-cda1-b7aa-993fd9132d53.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ViewSheetSetUIService Property

The UI service which permits registration of an external server for new UI managing ViewSheetSet.

## Syntax (C#)
```csharp
public static ExternalServiceId ViewSheetSetUIService { get; }
```